{
	"extends": "English",
	"dictionaries": {
		"worldLayer": {
			"modTroposphereTroposphere": "troposphere"
		},
		"note": {
			"modTroposphereFlying": [
				"Flying",
				"The wind rushed {hasHair?through my hair:over my bald head} and my heart raced as my nimbus flew through the clouds. After a few minutes, I arrived in a magical place miles above the ground which I am dubbing the \"troposphere\". At first I was nervous about how the clouds could be holding my weight, but my curiosity and my want of adventure got the better of me. At that point I decided that it's not worth it to dwell on such trivial things.\n\nAlthough the troposphere is beautiful and peaceful at first glance, it is likely a facade. My survival thus far, and the instincts I have accrued, have taught me to prepare for a challenge. I should not underestimate my surroundings: It wasn't long ago that I was losing to giant rats, writing publically about my negative experience, and then having my readers scoff at my ineptitude."
			]
		},
		"helpArticle": {
			"modTroposphereFlying": [
				"Flying",
				"Learn how the nimbus and flight works within the Troposphere mod.",
				"Learn how to soar up to the clouds with the Troposphere mod!",
				"Flight is only possible in the Troposphere modification through use of the \"nimbus\", a magical cloud item allowing flight to and from the troposphere layer. You can ascend and descend using the \"Fly\" action available from the {link(Menu.HelpArticle.Actions):item menu} of nimbus items.\n\nThe durability of nimbus items is limited, so make sure to conserve its use or craft new ones using a mixture of feathers, cloudstones, and snowflakes, all of which can be found in the troposphere layer.\n\nBe careful with holes in the clouds. The landing can be painful!"
			]
		},
		"message": {
			"modTroposphereFlewToTroposphere": "You flew to the troposphere.",
			"modTroposphereFlewToTroposphereFailure": "You are unable to fly to the troposphere here as the clouds are too thick.",
			"modTroposphereFlewToLand": "You flew back to land.",
			"modTroposphereFlewToLandFailure": "You are unable to fly to land here as the terrain below is unsuitable for landing.",
			"modTroposphereFellToLand": "You fell from the troposphere and lost {0} health.",
			"modTroposphereDeathByFalling": "from falling out of the sky",
			"modTroposphereGatheredRainbow": "You gathered the rainbow.",
			"modTroposphereNoRainbow": "You can only gather rainbows by standing infront of them."
		},
		"item": {
			"modTroposphereNimbus": ["nimbus", "The flying nimbus, a magical cloud that lifts you up to the troposphere."],
			"modTroposphereRainbow": ["rainbow", "A magical rainbow that somehow can occupy your inventory. Taste the Rainbow®."],
			"modTroposphereRainbowGlassBottle": ["glass bottle filled with a rainbow", "A magical rainbow trapped in a glass bottle. It almost looks good enough to drink."],
			"modTroposphereSnowflakes": ["snowflakes", "A couple of snowflakes that can somehow resist instantly melting in your grasp."],
			"modTroposphereCloudstone": ["cloudstone", "A magical cloud resource used in crafting more nimbuses, or is it nimbi?"]
		},
		"itemGroup": {
			"modTroposphereTroposphere": ["troposphere"]
		},
		"doodad": {
			"modTroposphereCloudBoulder": "cloud boulder",
			"modTroposphereStormBoulder": "storm boulder",
			"modTroposphereNimbus": "nimbus",
			"modTroposphereRainbow": ["rainbow", "A magical thing of beauty and colorful delight, ready to gather with a bottle and destroy for your own gain."]
		},
		"terrain": {
			"modTroposphereClouds": "clouds",
			"modTroposphereCloudWater": "cloud water",
			"modTroposphereCloudBoulder": "cloud boulder",
			"modTroposphereCloudstone": "cloudstone",
			"modTroposphereStorm": "storm",
			"modTroposphereStormBoulder": "storm boulder",
			"modTroposphereStormstone": "stormstone",
			"modTroposphereHole": "hole"
		},
		"creature": {
			"modTroposphereCloudBear": ["cloud bear", "Contrary to popular belief, this cloud bear does not care at all."],
			"modTroposphereCloudRabbit": ["cloud rabbit", "A rabbit that has seemingly been dyed with food coloring."],
			"modTroposphereCloudling": ["cloudling", "This bird does not tweet; it's more into the gram."],
			"modTroposphereLightningElemental": ["lightning elemental", "An otherworldly living ball of cloud fluff and electrostatic discharge."],
			"modTroposphereSprite": ["sprite", "The unofficial boss creature of the troposphere. Watch as it fades in and out of existence and probably one hits you dead."]
		},
		"corpse": {
			"modTroposphereLightningElemental": "fulgurite",
			"modTroposphereSprite": "ethereal mist"
		},
		"skill": {
			"modTroposphereFlying": ["flying", "Increases your damage resistance when falling from the troposphere."]
		},
		"action": {
			"modTroposphereFly": ["Fly", "Fly around the world."],
			"modTroposphereFlyToTroposphere": ["Fly to Troposphere", "Fly to and from the troposphere."],
			"modTroposphereGatherRainbow": ["Gather Rainbow", "Gather a rainbow with a container."]
		}
	}
}